W6D3/FirstRoutes/app/controllers/artworks_controller.rb

  def create
    art = Artwork.new(artwork_params)

    if art.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Fun"], ["image_url", "sample4"], ["artist_id", 18], ["created_at", "2022-02-03 21:28:43.932119"], ["updated_at", "2022-02-03 21:28:43.932119"]]

  def show
    render json: Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    art = Artwork.find(params[:id])
    	if art.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Stars"], ["updated_at", "2022-02-03 21:18:13.088234"], ["id", 11]]

  def destroy
    artworks = Artwork.find(params[:id])
    Artwork.find(params[:id]).destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 15]]